#task2
#2. გამრავლებისტაბულაორმაგიfor ციკლის_ისდახმარებითდაბეჭდეგამრავლებისტაბულა1_დანმომხმარებლისმიერშეყვანილიმთელირიცხვისჩათვლით.
a=int(input("number: "))
for i in range (1,a+1):
    for j in range (1,a+1):
        print(f"{i*j}", end=' ')
    print ()

#task 3
# საბანკოანგარიშიშეადგინეპროგრამარომელიცგანასახიერებსსაბანკოანგარიშს. მასზეგანთავსებულიათანხა3000 ლარისოდენობით. პროგრამაგეკითხებაგაწეულხარჯსდააკლებსანგარიშსმანამ, სანამარშეიყვან0_ს. შემდეგგიბეჭდავსანგარიშზედარჩენილთანხასდაწყვეტსფუნქციონირებას. თუანგარიშზეარსებულითანხანაკლებიადანახარჯისთანხაზე, პროგრამამუნდადაბეჭდოს, რომანგარიშზეარარისსაკმარისითანხადაგააგრძელოსფუნქციონირება.


account=3000

while   True:
        cost=int(input("შეიყვანე ხარჯი: ")) 
        if cost==0:
            print("ანგარიშზე არსებული ნაშთი:", account-cost)
            break
            
        elif cost<account:
           account=account-cost
           print("ანგარიშზე არსებული ნაშთი:",f"{account}") 
           continue
        else:
            cost>account
            print("ანგარიშზე არის არასკმარისი თანხა ")
            break

#task 4
#4.თუთიყუშისპროგრამადაწერეპროგრამა_ თუთიყუში. პროგრამამუნდაგაიმეოროსრასაცეტყვიმანამსანამარშეიყვანსიტყვასquit,თუმცაწინდაურთოსკითხვა„User Said Whaaat!?”თუშევიყვანეთსიტყვაHelloდაიბეჭდება„User Said Whaaat!?”“User Said Hello”

print ("User said Whaat!: ")
a=input ("User said: ")
while True:
    print ("User said Whaat!: ")
    a=input ("User said: ")
   
    if a=="quit":
        break
    else:
        print( f"{a}")
        continue
